; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-6-25)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	plane6 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	city12 - city
	city13 - city
	city14 - city
	city15 - city
	city16 - city
	city17 - city
	city18 - city
	city19 - city
	city20 - city
	city21 - city
	city22 - city
	city23 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city7)
	(fuel-level plane1 fl4)
	(at plane2 city0)
	(fuel-level plane2 fl1)
	(at plane3 city23)
	(fuel-level plane3 fl4)
	(at plane4 city1)
	(fuel-level plane4 fl5)
	(at plane5 city20)
	(fuel-level plane5 fl5)
	(at plane6 city2)
	(fuel-level plane6 fl3)
	(at person1 city3)
	(at person2 city3)
	(at person3 city7)
	(at person4 city3)
	(at person5 city23)
	(at person6 city21)
	(at person7 city19)
	(at person8 city1)
	(at person9 city5)
	(at person10 city15)
	(at person11 city15)
	(at person12 city14)
	(at person13 city20)
	(at person14 city18)
	(at person15 city17)
	(at person16 city0)
	(at person17 city15)
	(at person18 city9)
	(at person19 city4)
	(at person20 city7)
	(at person21 city18)
	(at person22 city0)
	(at person23 city2)
	(at person24 city0)
	(at person25 city10)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane2 city9)
	(at plane5 city15)
	(at plane6 city5)
	(at person1 city18)
	(at person2 city19)
	(at person3 city20)
	(at person4 city11)
	(at person5 city4)
	(at person6 city3)
	(at person7 city23)
	(at person8 city12)
	(at person9 city14)
	(at person10 city2)
	(at person11 city5)
	(at person12 city9)
	(at person13 city16)
	(at person14 city20)
	(at person15 city20)
	(at person16 city18)
	(at person17 city13)
	(at person18 city14)
	(at person19 city19)
	(at person20 city11)
	(at person21 city2)
	(at person22 city17)
	(at person23 city14)
	(at person24 city8)
	(at person25 city1)
	))

)

; plan
1. (zoom plane6 city2 city15 fl3 fl2 fl1)
   deleted: (at plane6 city2) (fuel-level plane6 fl3)
   added: (at plane6 city15) (fuel-level plane6 fl1)
   goals met: 0 of 28
2. (board person17 plane6 city15)
   deleted: (at person17 city15)
   added: (in person17 plane6)
   goals met: 0 of 28
3. (board person11 plane6 city15)
   deleted: (at person11 city15)
   added: (in person11 plane6)
   goals met: 0 of 28
4. (board person10 plane6 city15)
   deleted: (at person10 city15)
   added: (in person10 plane6)
   goals met: 0 of 28
5. (board person13 plane5 city20)
   deleted: (at person13 city20)
   added: (in person13 plane5)
   goals met: 0 of 28
6. (zoom plane5 city20 city15 fl5 fl4 fl3)
   deleted: (at plane5 city20) (fuel-level plane5 fl5)
   added: (at plane5 city15) (fuel-level plane5 fl3)
   goals met: 1 of 28
7. (board person8 plane4 city1)
   deleted: (at person8 city1)
   added: (in person8 plane4)
   goals met: 1 of 28
8. (zoom plane4 city1 city12 fl5 fl4 fl3)
   deleted: (at plane4 city1) (fuel-level plane4 fl5)
   added: (at plane4 city12) (fuel-level plane4 fl3)
   goals met: 1 of 28
9. (debark person8 plane4 city12)
   deleted: (in person8 plane4)
   added: (at person8 city12)
   goals met: 2 of 28
10. (board person5 plane3 city23)
   deleted: (at person5 city23)
   added: (in person5 plane3)
   goals met: 2 of 28
11. (zoom plane3 city23 city4 fl4 fl3 fl2)
   deleted: (at plane3 city23) (fuel-level plane3 fl4)
   added: (at plane3 city4) (fuel-level plane3 fl2)
   goals met: 2 of 28
12. (debark person5 plane3 city4)
   deleted: (in person5 plane3)
   added: (at person5 city4)
   goals met: 3 of 28
13. (board person19 plane3 city4)
   deleted: (at person19 city4)
   added: (in person19 plane3)
   goals met: 3 of 28
14. (zoom plane3 city4 city19 fl2 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl2)
   added: (at plane3 city19) (fuel-level plane3 fl0)
   goals met: 3 of 28
15. (board person7 plane3 city19)
   deleted: (at person7 city19)
   added: (in person7 plane3)
   goals met: 3 of 28
16. (refuel plane3 city19 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 28
17. (debark person19 plane3 city19)
   deleted: (in person19 plane3)
   added: (at person19 city19)
   goals met: 4 of 28
18. (fly plane3 city19 city23 fl1 fl0)
   deleted: (at plane3 city19) (fuel-level plane3 fl1)
   added: (at plane3 city23) (fuel-level plane3 fl0)
   goals met: 4 of 28
19. (debark person7 plane3 city23)
   deleted: (in person7 plane3)
   added: (at person7 city23)
   goals met: 5 of 28
20. (board person24 plane2 city0)
   deleted: (at person24 city0)
   added: (in person24 plane2)
   goals met: 5 of 28
21. (board person22 plane2 city0)
   deleted: (at person22 city0)
   added: (in person22 plane2)
   goals met: 5 of 28
22. (board person16 plane2 city0)
   deleted: (at person16 city0)
   added: (in person16 plane2)
   goals met: 5 of 28
23. (board person3 plane1 city7)
   deleted: (at person3 city7)
   added: (in person3 plane1)
   goals met: 5 of 28
24. (board person20 plane1 city7)
   deleted: (at person20 city7)
   added: (in person20 plane1)
   goals met: 5 of 28
25. (zoom plane1 city7 city11 fl4 fl3 fl2)
   deleted: (at plane1 city7) (fuel-level plane1 fl4)
   added: (at plane1 city11) (fuel-level plane1 fl2)
   goals met: 5 of 28
26. (debark person20 plane1 city11)
   deleted: (in person20 plane1)
   added: (at person20 city11)
   goals met: 6 of 28
27. (zoom plane1 city11 city20 fl2 fl1 fl0)
   deleted: (at plane1 city11) (fuel-level plane1 fl2)
   added: (at plane1 city20) (fuel-level plane1 fl0)
   goals met: 6 of 28
28. (debark person3 plane1 city20)
   deleted: (in person3 plane1)
   added: (at person3 city20)
   goals met: 7 of 28
29. (fly plane6 city15 city5 fl1 fl0)
   deleted: (at plane6 city15) (fuel-level plane6 fl1)
   added: (at plane6 city5) (fuel-level plane6 fl0)
   goals met: 8 of 28
30. (refuel plane6 city5 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 8 of 28
31. (board person9 plane6 city5)
   deleted: (at person9 city5)
   added: (in person9 plane6)
   goals met: 8 of 28
32. (debark person11 plane6 city5)
   deleted: (in person11 plane6)
   added: (at person11 city5)
   goals met: 9 of 28
33. (zoom plane5 city15 city16 fl3 fl2 fl1)
   deleted: (at plane5 city15) (fuel-level plane5 fl3)
   added: (at plane5 city16) (fuel-level plane5 fl1)
   goals met: 8 of 28
34. (debark person13 plane5 city16)
   deleted: (in person13 plane5)
   added: (at person13 city16)
   goals met: 9 of 28
35. (fly plane5 city16 city10 fl1 fl0)
   deleted: (at plane5 city16) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 9 of 28
36. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 28
37. (board person25 plane5 city10)
   deleted: (at person25 city10)
   added: (in person25 plane5)
   goals met: 9 of 28
38. (fly plane5 city10 city1 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city1) (fuel-level plane5 fl0)
   goals met: 9 of 28
39. (refuel plane5 city1 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 28
40. (debark person25 plane5 city1)
   deleted: (in person25 plane5)
   added: (at person25 city1)
   goals met: 10 of 28
41. (fly plane5 city1 city14 fl1 fl0)
   deleted: (at plane5 city1) (fuel-level plane5 fl1)
   added: (at plane5 city14) (fuel-level plane5 fl0)
   goals met: 10 of 28
42. (refuel plane5 city14 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 28
43. (board person12 plane5 city14)
   deleted: (at person12 city14)
   added: (in person12 plane5)
   goals met: 10 of 28
44. (fly plane5 city14 city9 fl1 fl0)
   deleted: (at plane5 city14) (fuel-level plane5 fl1)
   added: (at plane5 city9) (fuel-level plane5 fl0)
   goals met: 10 of 28
45. (refuel plane5 city9 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 10 of 28
46. (board person18 plane5 city9)
   deleted: (at person18 city9)
   added: (in person18 plane5)
   goals met: 10 of 28
47. (debark person12 plane5 city9)
   deleted: (in person12 plane5)
   added: (at person12 city9)
   goals met: 11 of 28
48. (fly plane5 city9 city14 fl1 fl0)
   deleted: (at plane5 city9) (fuel-level plane5 fl1)
   added: (at plane5 city14) (fuel-level plane5 fl0)
   goals met: 11 of 28
49. (refuel plane5 city14 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 11 of 28
50. (debark person18 plane5 city14)
   deleted: (in person18 plane5)
   added: (at person18 city14)
   goals met: 12 of 28
51. (fly plane5 city14 city15 fl1 fl0)
   deleted: (at plane5 city14) (fuel-level plane5 fl1)
   added: (at plane5 city15) (fuel-level plane5 fl0)
   goals met: 13 of 28
52. (fly plane2 city0 city17 fl1 fl0)
   deleted: (at plane2 city0) (fuel-level plane2 fl1)
   added: (at plane2 city17) (fuel-level plane2 fl0)
   goals met: 13 of 28
53. (zoom plane4 city12 city18 fl3 fl2 fl1)
   deleted: (at plane4 city12) (fuel-level plane4 fl3)
   added: (at plane4 city18) (fuel-level plane4 fl1)
   goals met: 13 of 28
54. (board person21 plane4 city18)
   deleted: (at person21 city18)
   added: (in person21 plane4)
   goals met: 13 of 28
55. (board person14 plane4 city18)
   deleted: (at person14 city18)
   added: (in person14 plane4)
   goals met: 13 of 28
56. (refuel plane2 city17 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 13 of 28
57. (debark person22 plane2 city17)
   deleted: (in person22 plane2)
   added: (at person22 city17)
   goals met: 14 of 28
58. (board person15 plane2 city17)
   deleted: (at person15 city17)
   added: (in person15 plane2)
   goals met: 14 of 28
59. (fly plane4 city18 city2 fl1 fl0)
   deleted: (at plane4 city18) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 14 of 28
60. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 14 of 28
61. (board person23 plane4 city2)
   deleted: (at person23 city2)
   added: (in person23 plane4)
   goals met: 14 of 28
62. (debark person21 plane4 city2)
   deleted: (in person21 plane4)
   added: (at person21 city2)
   goals met: 15 of 28
63. (fly plane4 city2 city14 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city14) (fuel-level plane4 fl0)
   goals met: 15 of 28
64. (refuel plane4 city14 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 15 of 28
65. (debark person23 plane4 city14)
   deleted: (in person23 plane4)
   added: (at person23 city14)
   goals met: 16 of 28
66. (fly plane4 city14 city20 fl1 fl0)
   deleted: (at plane4 city14) (fuel-level plane4 fl1)
   added: (at plane4 city20) (fuel-level plane4 fl0)
   goals met: 16 of 28
67. (debark person14 plane4 city20)
   deleted: (in person14 plane4)
   added: (at person14 city20)
   goals met: 17 of 28
68. (fly plane2 city17 city18 fl1 fl0)
   deleted: (at plane2 city17) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 17 of 28
69. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 17 of 28
70. (debark person16 plane2 city18)
   deleted: (in person16 plane2)
   added: (at person16 city18)
   goals met: 18 of 28
71. (fly plane2 city18 city20 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city20) (fuel-level plane2 fl0)
   goals met: 18 of 28
72. (refuel plane2 city20 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 18 of 28
73. (debark person15 plane2 city20)
   deleted: (in person15 plane2)
   added: (at person15 city20)
   goals met: 19 of 28
74. (fly plane2 city20 city8 fl1 fl0)
   deleted: (at plane2 city20) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 19 of 28
75. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 19 of 28
76. (debark person24 plane2 city8)
   deleted: (in person24 plane2)
   added: (at person24 city8)
   goals met: 20 of 28
77. (fly plane2 city8 city21 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city21) (fuel-level plane2 fl0)
   goals met: 20 of 28
78. (refuel plane2 city21 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 20 of 28
79. (board person6 plane2 city21)
   deleted: (at person6 city21)
   added: (in person6 plane2)
   goals met: 20 of 28
80. (fly plane2 city21 city3 fl1 fl0)
   deleted: (at plane2 city21) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 20 of 28
81. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 20 of 28
82. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   goals met: 21 of 28
83. (board person4 plane2 city3)
   deleted: (at person4 city3)
   added: (in person4 plane2)
   goals met: 21 of 28
84. (board person2 plane2 city3)
   deleted: (at person2 city3)
   added: (in person2 plane2)
   goals met: 21 of 28
85. (board person1 plane2 city3)
   deleted: (at person1 city3)
   added: (in person1 plane2)
   goals met: 21 of 28
86. (fly plane2 city3 city11 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 21 of 28
87. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 21 of 28
88. (debark person4 plane2 city11)
   deleted: (in person4 plane2)
   added: (at person4 city11)
   goals met: 22 of 28
89. (fly plane2 city11 city18 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city18) (fuel-level plane2 fl0)
   goals met: 22 of 28
90. (refuel plane2 city18 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 22 of 28
91. (debark person1 plane2 city18)
   deleted: (in person1 plane2)
   added: (at person1 city18)
   goals met: 23 of 28
92. (fly plane2 city18 city19 fl1 fl0)
   deleted: (at plane2 city18) (fuel-level plane2 fl1)
   added: (at plane2 city19) (fuel-level plane2 fl0)
   goals met: 23 of 28
93. (refuel plane2 city19 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 23 of 28
94. (debark person2 plane2 city19)
   deleted: (in person2 plane2)
   added: (at person2 city19)
   goals met: 24 of 28
95. (fly plane2 city19 city9 fl1 fl0)
   deleted: (at plane2 city19) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 25 of 28
96. (fly plane6 city5 city13 fl1 fl0)
   deleted: (at plane6 city5) (fuel-level plane6 fl1)
   added: (at plane6 city13) (fuel-level plane6 fl0)
   goals met: 24 of 28
97. (refuel plane6 city13 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 24 of 28
98. (debark person17 plane6 city13)
   deleted: (in person17 plane6)
   added: (at person17 city13)
   goals met: 25 of 28
99. (fly plane6 city13 city14 fl1 fl0)
   deleted: (at plane6 city13) (fuel-level plane6 fl1)
   added: (at plane6 city14) (fuel-level plane6 fl0)
   goals met: 25 of 28
100. (refuel plane6 city14 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 25 of 28
101. (debark person9 plane6 city14)
   deleted: (in person9 plane6)
   added: (at person9 city14)
   goals met: 26 of 28
102. (fly plane6 city14 city2 fl1 fl0)
   deleted: (at plane6 city14) (fuel-level plane6 fl1)
   added: (at plane6 city2) (fuel-level plane6 fl0)
   goals met: 26 of 28
103. (refuel plane6 city2 fl0 fl1)
   deleted: (fuel-level plane6 fl0)
   added: (fuel-level plane6 fl1)
   goals met: 26 of 28
104. (debark person10 plane6 city2)
   deleted: (in person10 plane6)
   added: (at person10 city2)
   goals met: 27 of 28
105. (fly plane6 city2 city5 fl1 fl0)
   deleted: (at plane6 city2) (fuel-level plane6 fl1)
   added: (at plane6 city5) (fuel-level plane6 fl0)
   goals met: 28 of 28
